<template>
    <div class="heart bgd bg-private-bg">
        <div class="panel">
            <Title title="真心话" @leftClick="backHandler"/>
            <Imag :src="getBg" classes="backdrop" />
            <span class="question">{{question}}</span>
            <div class="btn" @click="finish">本题完成</div>
            <div class="btn" @click="jump" v-if="canJump">跳过本题</div>
        </div>
    </div>
</template>

<script>
    import Title from '../component/title.vue'
    import REQ from '../common/request'
    import Imag from '../component/Image.vue'

    const arrayTruth = [
        "你的初吻是几岁在什么地方被什么人夺去的?",
        "你的初恋是几岁?",
        "一共挂过几门课？",
        "所有考试中，你考到最低的一门是什么课，考了几分？",
        "你吻过几个人？",
        "在现场所有人中，你对哪个异性有好感？",
        "如果再给你一次机会，回到初中毕业那天，你最想对某一位异性说什么话？",
        "你曾经意淫过在场的哪一位？如果过去没有的话，你现在会选哪一位作为YY对象？",
        "谈过几次恋爱？",
        "每天睡觉前都会想起的人是谁？",
        "你最怕的事情或东西是什么（说出三件）?",
        "你会为了爱情牺牲一切，包括生命吗？",
        "和多少异性有过非恋爱的暧昧关系？",
        "你作弊使用过的最高招（呵呵，可能有的人是从来不作弊的，所以……大家提提意见）",
        "从小到大最丢脸出丑的事情是什么？",
        "如果明天是世界末日，你现在最想做的是什么？",
        "如果让你kiss现场的某一位异性，你会选择谁，为什么？",
        "说出同寝室的人最让你受不了的习惯",
        "最欣赏自己哪个部位？对自己那个部位最不满意？",
        "和男/女朋友进行到哪一步了?",
        "内衣/裤颜色?",
        "最后一次发自内心的笑是什么时候？",
        "身上哪个部位最敏感?",
        "如果有来生，你希望是男还是女?",
        "如果有一天我和你吵架，你会怎么办？",
        "哭得最伤心的是哪一次？为什么？",
        "如果跟你喜欢的人约会，碰到前任的男（女）朋友，会有什么表现？",
        "上一次接吻的是什么时候？和谁？",
        "暗恋过几个异性？有主动追求过吗？",
        "最喜欢吃的食物?",
        "曾经看了流泪的电影？",
        "你会期待一夜情吗？",
        "无聊的时候一般做什么？",
        "会经常便秘吗?",
        "最尴尬的事？",
        "最伤心的经历？",
        "你身上有没有胎记？长在什么地方，什么形状？",
        "理想中的另一半是什么样子？",
        "在和男、女朋友交往的过程中，有被甩过吗？",
        "说出五种避孕方式？",
        "你是否会有时孤枕难眠？",
        "请讲述未来5年的事业规划？",
        "你认为男人善变还是女人善变？",
        "你在寂寞时，会想起谁？",
        "只给你一天时间当异性，你最想做什么？",
        "自己最宝贵的财富是什么？",
        "生过的最严重的病是什么？",
        "讲述自己最得意的一件事情？",
        "第一次性经历是何时？",
        "平生最成功的一次撒谎？",
        "男女朋友分手后还能做普通朋友吗？",
        "每个月的开销是多少？花到哪去了？",
        "你会不会向自己暗恋的人表白?怎么样表白？",
        "你认为女生都是很现实的吗?",
        "为什么男人不坏，女人不爱？",
        "你认为男生就该养家吗?",
        "你说过几次“我爱你”？",
        "什么样的女人、男人才有女人味男人味？",
        "你听过、说过的最感人的情话？",
        "你接受姐弟恋吗？ 几岁的范围可以接受？",
        "思想出轨和身体出轨，哪个比较能够接受？",
        "你说女友该不该花男友的钱？",
        "你会选择爱还是被爱？",
        "如果一天之内要用光十万元，你要怎么样花？",
        "你最讨厌什么样的人？",
        "你觉得自己的脸皮厚还是薄？",
        "你最短的一次恋爱是什么情况?",
        "你觉得什么样式的内裤最性感?",
        "今天拉屎没有?",
        "最长一次连续睡着了多久?",
        "多久换一次内裤?",
        "你喜欢裸睡么?",
        "你在感情上劈过腿没有?",
        "你一共收藏了多少小电影?",
        "当过第三者么?",
        "在自己最爱的人面前做过最囧的事是什么?",
        "你觉得自己长的如何?",
        "第一次ML是什么感觉",
        "最奢侈的一次消费是什么?",
        "如果看到自己最爱的人熟睡在你面前你会做什么？",
        "你最想要的5样东西?",
        "最后一次发自内心的笑是什么时候？",
        "如果给你一个机会去世界上任何一个地方旅行你会去哪?",
        "如果时间能倒流你希望回到哪一时间？",
        "如果让你拥有一种超能力，你愿意拥有什么呢？",
        "最喜欢哪部电影？",
        "最喜欢的食物是什么?",
        "如果你爱的人不爱你怎么办？",
        "如果从天而降99枚金币，你的第一反应是什么？",
        "世界末日，你会幸存，并且你可以救一个人，你会怎么做？",
        "你在乎别人看你的眼光吗？会为了众人的反对放弃自己想要的东西或人吗？",
        "你有恨过谁吗？",
        "远距离恋爱是否注定要分开？那么如果喜欢上一个遥远国度的人，你是否会选择跟他走？",
        "如果能预知未来，你最不希望看见的是什么？",
        "情人节最想收到什么礼物？",
        "喜欢看什么动画片？",
        "你最不开心的时候会有什么表现？",
        "在爱情和面包中，你会选择哪个？为什么？",
        "最想感谢的人是谁？",
        "想过自己以后是干什么的吗？你的理想职业是什么？",
        "你觉得最美的画面是什么？",
        "到目前为止你做过最疯狂的事是？",
        "如果请你从在座的里面选一位做你的男女朋友,你会选谁? ",
        "你最喜欢的小说是什么?",
        "你每天都洗屁屁么?",
        "你觉得自己放的屁臭不臭?",
        "用四个字形容你现在的生活状态?",
        "在座你最想打的人是谁?",
        "收到过最难忘的礼物是什么?",
        "会在婚前跟恋人发生关系么?",
    ]

    export default {
        props: [],
        components: {Title, Imag},

        data() {
            return {
                question: '',
                canJump: true,
            }
        },

        computed: {
            getBg() {
                return REQ.apiStaticDomain + '/static/img/new/zhenxinhua.gif.webp'
            },
        },

        mounted() {
            this.getQuestion()
        },

        methods: {
            backHandler() {
                window.history.back()
            },

            getQuestion() {
                const random = parseInt(Math.random() * arrayTruth.length)
                this.question = arrayTruth[random]
            },

            finish() {
                this.$router.replace({name: 'Play'})
            },

            jump() {
                this.canJump = false
                this.getQuestion()
            }
        }
    }
</script>

<style lang='scss' scoped>
    @import './../../../style/sass/mixin.scss';

    .heart {
        @include window;

        .panel {
            @include game-panel;
            align-items: center;

            .backdrop {
                width: 80%;
                margin-top: 30px;
            }

            .question {
                color: #F5F5F5;
                @include font-dpr(18px);
                width: 55%;
                position: absolute;
                top: 200px;
                text-align: center;
            }

            .btn {
                color: #F5F5F5;
                background: #CD533E;
                padding: 10px 0;
                width: 50%;
                font-size: 15px;
                border-radius: 5px;
                text-align: center;
                margin-top: 20px;
            }
        }
    }
</style>